#### `terragrunt plan` Success
<details><summary>Show Output</summary>

```
Acquiring state lock. This may take a few moments...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG]
azurerm_public_ip.public_ip: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/publicIPAddresses/public_ip]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/networkSecurityGroups/TestSecurityGroup01]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/virtualNetworks/TF-VNET1]
azurerm_subnet.internal: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/virtualNetworks/TF-VNET1/subnets/internal]
azurerm_network_interface.interface: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/networkInterfaces/network_interface]
azurerm_network_interface_security_group_association.nsg_associate: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/networkInterfaces/network_interface|/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/networkSecurityGroups/TestSecurityGroup01]
azurerm_virtual_machine.server: Refreshing state... [id=/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Compute/virtualMachines/ubuntu_server_demo]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_subnet.internal has been changed
  ~ resource "azurerm_subnet" "internal" {
        id                                             = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/virtualNetworks/TF-VNET1/subnets/internal"
        name                                           = "internal"
      + service_endpoint_policy_ids                    = []
      + service_endpoints                              = []
        # (6 unchanged attributes hidden)
    }
  # azurerm_virtual_machine.server has been changed
  ~ resource "azurerm_virtual_machine" "server" {
        id                               = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Compute/virtualMachines/ubuntu_server_demo"
        name                             = "ubuntu_server_demo"
      + tags                             = {}
      + zones                            = []
        # (6 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }
  # azurerm_virtual_network.main has been changed
  ~ resource "azurerm_virtual_network" "main" {
        id                    = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/virtualNetworks/TF-VNET1"
        name                  = "TF-VNET1"
      ~ subnet                = [
          + {
              + address_prefix = "10.30.2.0/24"
              + id             = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/virtualNetworks/TF-VNET1/subnets/internal"
              + name           = "internal"
              + security_group = ""
            },
        ]
      + tags                  = {}
        # (6 unchanged attributes hidden)
    }
  # azurerm_network_interface.interface has been changed
  ~ resource "azurerm_network_interface" "interface" {
        id                            = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/networkInterfaces/network_interface"
      + mac_address                   = "00-0D-3A-9E-1C-EB"
        name                          = "network_interface"
      + tags                          = {}
      + virtual_machine_id            = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Compute/virtualMachines/ubuntu_server_demo"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # azurerm_network_security_group.nsg has been changed
  ~ resource "azurerm_network_security_group" "nsg" {
        id                  = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/networkSecurityGroups/TestSecurityGroup01"
        name                = "TestSecurityGroup01"
      + tags                = {}
        # (3 unchanged attributes hidden)
    }
  # azurerm_public_ip.public_ip has been changed
  ~ resource "azurerm_public_ip" "public_ip" {
        id                      = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Network/publicIPAddresses/public_ip"
      + ip_tags                 = {}
        name                    = "public_ip"
      + tags                    = {}
        # (9 unchanged attributes hidden)
    }
  # azurerm_resource_group.rg has been changed
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG"
        name     = "TF-Demo-RG"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_virtual_machine.server must be replaced
-/+ resource "azurerm_virtual_machine" "server" {
      + availability_set_id              = (known after apply)
      ~ id                               = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Compute/virtualMachines/ubuntu_server_demo" -> (known after apply)
      + license_type                     = (known after apply)
        name                             = "ubuntu_server_demo"
      - tags                             = {} -> null
      ~ vm_size                          = "Standard_D2_v2" -> "Standard_D1_v2"
      - zones                            = [] -> null
        # (5 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      - os_profile { # forces replacement
          - admin_username = "student31" -> null
          - computer_name  = "server" -> null
        }
      + os_profile { # forces replacement
          + admin_password = (sensitive value)
          + admin_username = "student"
          + computer_name  = "server"
          + custom_data    = (known after apply)
        }


      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }


      ~ storage_os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ managed_disk_id           = "/subscriptions/ccbf98e3-670c-4a88-87b3-6a556a45c86b/resourceGroups/TF-Demo-RG/providers/Microsoft.Compute/disks/web_os_disk" -> (known after apply)
            name                      = "web_os_disk"
          ~ os_type                   = "Linux" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
time=2021-06-29T04:03:50Z level=error msg=1 error occurred:
	* exit status 2
```

</details>

*Workflow: `Terragrunt GitHub Actions`, Action: `the-commons-projectterragrunt-github-actions4`, Working Directory: `.`, Workspace: `default`*
